//Обчислити кількість послідовностей довжиною n, що складаються лише з нулів і одиниць, де не зустрічається три одиниці підряд.
//
//Вхідні дані: Довжина послідовностей n (1 < n < 10000)
//
//Вихідні дані: Вивести кількість шуканих послідовностей за модулем 12345.

#include <stdio.h>
#include <windows.h>

//використовуємо динамічне програмування для підрахунку кількості послідовностей.
// ми створюємо масив dp, де dp[i] представляє кількість послідовностей довжиною i, що задовольняють умови завдання.
int countSequences(int n) {
    int dp[n+1];
    dp[0] = 1;
    dp[1] = 2;
    dp[2] = 4;

//    щоб підрахувати кількість послідовностей довжиною i,
//    ми додаємо кількість послідовностей довжиною i-1 (закінчуються нулем),
//    i-2 (закінчуються одним нулем) та i-3 (закінчуються двома нулями).
    for (int i = 3; i <= n; i++) {
        dp[i] = (dp[i-1] + dp[i-2] + dp[i-3]) % 12345;
    }

    return dp[n];
}

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

    int n;

    printf("Введіть довжину послідовностей n (1 < n < 10000): ");
    scanf("%d", &n);

//    викликаємо функцію countSequences і передаємо їй введене значення
    int result = countSequences(n);

//    виводимо значення result, яке представляє кількість шуканих послідовностей за модулем 12345
    printf("Кількість шуканих послідовностей: %d\n", result);

    return 0;
}

