//Дано два кола, визначте кількість точок перетину
//
//Вхідні дані: шість чисел х1, y1, r1, х2, y2, r2, де х1, y1, х2, y2 - координати центрів, а r1 та r2 - їх радіуси.
//
//Вихідні дані: кількість точок перетину. Якщо точок перетину безкінечно багато, то вивести -1.

#include <stdio.h>
#include <math.h>
#include <windows.h>

//визначаємо функцію countIntersectionPoints, яка приймає координати центрів (x1, y1) та (x2, y2) і радіуси r1 та r2 двох кол
int countIntersectionPoints(int x1, int y1, int r1, int x2, int y2, int r2) {

//    обчислюємо відстань між центрами двох кол за допомогою формули відстані між двома точками
    double distance = sqrt(pow(x2 - x1, 2) + pow(y2 - y1, 2));

//    Якщо відстань між центрами більша за суму радіусів, то кола не перетинаються і повертаємо 0.
    if (distance > r1 + r2) {
        // Кола не перетинаються
        return 0;

//    Якщо відстань між центрами рівна 0 і радіуси однакові, то кола співпадають і повертаємо -1
    } else if (distance == 0 && r1 == r2) {
        // Кола співпадають
        return -1;

//    Якщо відстань між центрами рівна сумі або різниці радіусів, то кола торкаються ззовні або зсередини і повертаємо 1
    } else if (distance == r1 + r2 || distance == fabs(r1 - r2)) {
        // Кола торкаються ззовні або зсередини
        return 1;

//    Якщо відстань між центрами менша за суму радіусів і більша за різницю радіусів, то кола перетинаються в двох точках і повертаємо 2
    } else if (distance < r1 + r2 && distance > fabs(r1 - r2)) {
        // Кола перетинаються в двох точках
        return 2;

//    У всіх інших випадках кола розміщені одне всередині іншого і повертаємо 0
    } else {
        // Кола розміщені одне всередині іншого
        return 0;
    }
}

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

    int x1, y1, r1, x2, y2, r2;

//    зчитуємо координати центрів і радіуси двох кол з вхідного потоку за допомогою scanf
    printf("Введіть координати центру першого кола (x1, y1): ");
    scanf("%d %d", &x1, &y1);
    printf("Введіть радіус першого кола r1: ");
    scanf("%d", &r1);

    printf("Введіть координати центру другого кола (x2, y2): ");
    scanf("%d %d", &x2, &y2);
    printf("Введіть радіус другого кола r2: ");
    scanf("%d", &r2);

//    викликаємо функцію countIntersectionPoints і передаємо їй введені значення
    int result = countIntersectionPoints(x1, y1, r1, x2, y2, r2);

//    значення кількості точок перетину зберігається у змінній result і виводиться на екран
    printf("Кількість точок перетину: %d\n", result);

    return 0;
}

