//Скільки можна сформувати чисел із р розрядів,
// використовуючи цифри 5 та 9, в яких три однакові цифри не стоять поруч?
//
//Вхідні дані: ціле число р (р ≤ 30)
//
//Вихідні дані: кількість чисел із р розрядів

#include <stdio.h>
#include <windows.h>

// функція для обчислення кількості чисел із n розрядів
int countNumbers(int n) {

    //    якщо розрядів 0, то виводимо 0
    if (n <= 0)
        return 0;

    //    якщо розрядів 1, то виводимо 2 -> 5 або 9
    if (n == 1) {
        return 2;
    }

    // ініціалізуємо змінні
    int count = 0;
    int prevCount = 1;

// цикл для обчислення кількості чисел з n розрядів
    for (int i = 2; i <= n; i++) {

        // множимо на 2, оскільки є дві можливості (5 або 9) для кожного розряду
        count = 2 * prevCount;
        prevCount = count;
    }

    return count;
}

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

    int n;
    printf("Введіть кількість розрядів n: ");
    scanf("%d", &n);

    //    викликаємо функцію countNumbers і передаємо їй введену кількість розрядів
    int result = countNumbers(n);

    //    виводимо значення result, яке представляє кількість чисел з n розрядів
    printf("Кількість чисел із %d розрядів: %d\n", n, result);

    return 0;
}