//Знайти найменше спільне кратне р натуральних чисел
//
//Вхідні дані: в першому рядку задано кількість чисел р(2 ≤ р ≤ 20),
// а в другому рядку р натуральних чисел, розділені пробілом
//
//Вихідні дані: найменше спільне кратне заданих чисел

#include <stdio.h>
#include <windows.h>

// функція для обчислення найбільшого спільного дільника
int findGCD(int a, int b) {

//  використовуємо алгоритм Евкліда для обчислення найбільшого спільного дільника.
    while (b != 0) {
        int temp = b;
        b = a % b;
        a = temp;
    }
    return a;
}

// функція для обчислення найменшого спільного кратного
int findLCM(int arr[], int n) {

//  ініціалізуємо змінну lcm з першим елементом масиву.
    int lcm = arr[0];

//  проходимо по решті елементів масиву і обчислюємо нове значення lcm, використовуючи формулу (lcm * arr[i]) / findGCD(lcm, arr[i]).
    for (int i = 1; i < n; i++) {
        lcm = (lcm * arr[i]) / findGCD(lcm, arr[i]);
    }

//    повертаємо значення lcm як результат
    return lcm;
}

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

//    зчитуємо кількість чисел p зі стандартного вводу
    int p;
    scanf("%d", &p);

//    зчитуємо p числа у масиві numbers.
    int numbers[p];
    for (int i = 0; i < p; i++) {
        scanf("%d", &numbers[i]);
    }

//    викликаємо функцію findLCM з масивом чисел і виводимо результат як найменше спільне кратне.
    int lcm = findLCM(numbers, p);
    printf("%d\n", lcm);

    return 0;
}
