//Анаграмою слова називають перестановку всіх букв слова.
// Наприклад зі слова SOLO можна отримати 12 анаграм: SOLO, LOSO, OSLO, OLSO, OSOL, OLOS, SLOO, OOLS, OOSL, LOOS, SOOL.
// напишіть програму, яка виводитиме кількість анаграм , які можуть вийти зі слова.
//
//Вхідні дані: в одному рядку задане слово, кількість букв якого не перевищує 14.
//
//Вихідні дані: кількість можливих анаграм.

#include <stdio.h>
#include <string.h>
#include <windows.h>

//визначаємо функцію, яка обчислює факторіал числа.
// вона використовується для підрахунку знаменника у формулі для підрахунку анаграм.
int factorial(int n) {
    if (n == 0 || n == 1) {
        return 1;
    } else {
        return n * factorial(n - 1);
    }
}

//функція отримує слово в якості вхідного параметра.
int countAnagrams(char* word) {
    int len = strlen(word);
    int count[26] = {0}; // масив для підрахунку кількості кожної букви
    int numerator = factorial(len); // чисельник у формулі для підрахунку анаграм

    // підрахунок кількості кожної букви
    for (int i = 0; i < len; i++) {
        count[word[i] - 'A']++;
    }

//    проходимося по масиву count і знаходимо кількість букв,
//    які мають кількість входжень більше одного.
//    для цих букв ми ділимо чисельник на факторіал їх кількості.
    for (int i = 0; i < 26; i++) {
        if (count[i] > 1) {
            numerator /= factorial(count[i]);
        }
    }

    return numerator;
}

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

    char word[15];

//    зчитуємо введене слово з вхідного потоку за допомогою scanf
    printf("Введіть слово: ");
    scanf("%s", word);

//    викликаємо функцію countAnagrams і передаємо їй введене слово
    int result = countAnagrams(word);

//    значення кількості анаграм зберігається у змінній result і виводиться на екран
    printf("Кількість можливих анаграм: %d\n", result);

    return 0;
}
