//Розглянемо процес переходу від цілого x до цілого y вздовж цілих точок прямої. Довжина кожного кроку має бути невід’ємною та бути або на одиницю більшою, або дорівнювати, або на одиницю меншою за довжину попереднього кроку. Довжина першого і останнього кроків повинна бути 1.
//
//Створіть функцію, яка обчислює мінімальну кількість кроків, необхідних для переходу від x до y. Він повинен обробляти 0 <= x <= y < 2 31 .
//
//приклади:
//
//x = 45, y = 48: зрозуміло, що кроків дорівнює 46, 47, 48, тому результат дорівнює 3.
//
//x = 45, y = 49: ми можемо зробити один 2-кроковий: 46,48,49, тож результат все одно буде 3.
//
//x = 45, y = 50: ще один 2-кроковий: 46,48,49,50, тож результат 4.
//
//x = 45, y = 51: два 2-кроки: 46,48,50,51, тому результат залишається 4.

#include <stdio.h>
#include <windows.h>

//визначаємо функцію, яка приймає два аргументи: x і y, відповідно початкову та кінцеву точки.
// функція розраховує мінімальну кількість кроків, необхідних для переходу від x до y згідно з заданими умовами.
int minimumSteps(int x, int y) {

//    Якщо y менше або дорівнює x, ми просто повертаємо різницю між x і y, оскільки немає потреби в будь-яких кроках.
    if (y <= x) {
        return x - y;
    }

//    В іншому випадку ми ініціалізуємо змінну count для підрахунку кількості кроків і знаходимо різницю між y і x
    int count = 0;
    int diff = y - x;

//Якщо різниця є парним числом, ми ділимо її на 2.
//Якщо різниця є числом, яке залишається 1 при діленні на 4 або дорівнює 3, ми віднімаємо 1.
//У всіх інших випадках ми додаємо 1.
//Цей процес повторюється до тих пір, поки різниця не стає меншою або дорівнює 2.
    while (diff > 2) {
        if (diff % 2 == 0) {
            diff /= 2;
        } else if (diff % 4 == 1 || diff == 3) {
            diff -= 1;
        } else {
            diff += 1;
        }
        count++;
    }

    //На останньому кроці ми додаємо різницю до count, щоб врахувати останній крок.
    return count + diff;
}

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

    int x, y;

//    зчитуємо введені значення x і y за допомогою scanf
    printf("Введіть значення x: ");
    scanf("%d", &x);
    printf("Введіть значення y: ");
    scanf("%d", &y);

//    викликаємо функцію minimumSteps і передаємо їй ці значення
    int result = minimumSteps(x, y);

//    значення мінімальної кількості кроків зберігається у змінній result і виводиться на екран
    printf("Мінімальна кількість кроків: %d\n", result);

    return 0;
}
