//Натуральне число m називається рівним дільником числа n,
// якщо частка і залишок від ділення n на m дорівнюють одне одному.
// Для заданого натурального числа n знайти кількість його рівних дільників.
//
//Вхідні дані:  Натуральне число n (1 < n < 150).
//
//Вихідні дані: Вивести одне шукане число.

#include <stdio.h>
#include <windows.h>

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

    unsigned int n;
    int count = 0;

    printf("Введіть натуральне число n (1 < n < 150): ");
    scanf("%u", &n);

    // перевіряємо кожне число від 1 до n-1
    for (unsigned int m = 1; m < n; m++) {

//        вираз n % m дає нам залишок від ділення n на m, а n / m дає нам частку
//        якщо ці два значення рівні одне одному, то m є рівним дільником n, тому збільшуємо лічильник count.
        if (n % m == n / m) {
            count++;
        }
    }

//    виводимо значення count, що представляє кількість рівних дільників числа n
    printf("Кількість рівних дільників числа %u: %d\n", n, count);

    return 0;
}

