//Визначити довжину вектора за його координатами.
//
//Вхідні дані: чотири цілі числа х1, у1, х2, у2 - кордина ти початку та кінця вектора відповідно
//
//Вихідні дані: одне число - довжина вектора з точністю до шести знаків після коми

#include <stdio.h>
#include <math.h>
#include <windows.h>

//визначаємо функцію calculateVectorLength, яка приймає координати початку (x1, y1) та кінця (x2, y2) вектора
double calculateVectorLength(int x1, int y1, int x2, int y2) {

//    використовуючи формулу для обчислення відстані між двома точками в декартовій системі координат,
//    ми розраховуємо довжину вектора за допомогою формули length = sqrt(dx*dx + dy*dy),
//    де dx - різниця між координатами x2 та x1, а dy - різниця між координатами y2 та y1.
    int dx = x2 - x1;
    int dy = y2 - y1;
    double length = sqrt(dx*dx + dy*dy);
    return length;
}

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

    int x1, y1, x2, y2;

//    зчитуємо координати початку і кінця вектора з вхідного потоку за допомогою scanf
    printf("Введіть координати точки початку вектора (x1, y1): ");
    scanf("%d %d", &x1, &y1);

    printf("Введіть координати точки кінця вектора (x2, y2): ");
    scanf("%d %d", &x2, &y2);

//    викликаємо функцію calculateVectorLength і передаємо їй введені координати
    double length = calculateVectorLength(x1, y1, x2, y2);

//    отримане значення довжини вектора зберігається у змінній length і виводиться на екран з точністю до шести знаків після коми за допомогою форматування %.6f
    printf("Довжина вектора: %.6f\n", length);

    return 0;
}

