// Перший гість може з’їсти пиріг за t1 годин, другий гість може з’їсти пиріг за t2 годин,
// третій гість може з'їсти пиріг за t3 годин. Скільки часу потрібно гостям щоб з’їсти один пиріг?
//
//Вхідні дані: один рядок який містить три натуральних числа t1, t2, t3,
//  кожне з котрих не перевищує 10000.
//
//Вихідні дані: вивести час в годинах, за який гості разом можуть з’їсти пиріг.
// Результат округлити до 2 знаків після коми

#include <stdio.h>
#include <windows.h>

int main() {
    SetConsoleCP(65001);// вирішення проблеми з кирилицею
    SetConsoleOutputCP(65001);

//  спочатку зчитуємо значення t1, t2, t3 зі стандартного вводу.
    int t1, t2, t3;
    printf("Введіть три значення:\n");
    scanf("%d %d %d", &t1, &t2, &t3);

//  потім використовуємо формулу: 1 / t1 + 1 / t2 + 1 / t3 для обчислення загального часу, який гості потребують, щоб з'їсти один пиріг
    double total_time = 1.0 / t1 + 1.0 / t2 + 1.0 / t3;

//  далі, використовуючи формулу: 1 / (1 / t1 + 1 / t2 + 1 / t3) ми знаходимо час, за який гості разом зможуть з'їсти пиріг
    double time_to_eat_cake = 1.0 / total_time;

//  виводимо цей час з округленням до 2 знаків після коми за допомогою форматування %.2f.
    printf("Час, необхідний для з'їдання пирога: %.2f годин\n", time_to_eat_cake);

    return 0;
}
